## Import Library

In [1]:
import numpy as np
import pandas as pd

### Series and Dataframe

In [2]:
pd.Series?

In [3]:
pd.DataFrame?

In [4]:
my_pets = ['Lion', 'Cat', 'Birds', 'Fish']
my_pets

['Lion', 'Cat', 'Birds', 'Fish']

In [5]:
pd.Series(my_pets) # Converting our list to Series with indexes

0     Lion
1      Cat
2    Birds
3     Fish
dtype: object

### We can create our own index overiding default index(0,1,2...)

In [6]:
my_index = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday']

In [7]:
my_courses = ['Economics', 'Geography', 'Finance', 'Mathematics', 'History']

In [8]:
pd.Series(my_courses)

0      Economics
1      Geography
2        Finance
3    Mathematics
4        History
dtype: object

In [9]:
pd.Series(my_courses, index=my_index)

Monday         Economics
Tuesday        Geography
Wednesday        Finance
Thursday     Mathematics
Friday           History
dtype: object

In [10]:
days = pd.Series(['Mon', 'Tues', 'Wed', 'Thurs', 'Fri'], index=['Day1', 'Day2', 'Day3', 'Day4', 'Day5'])
days

Day1      Mon
Day2     Tues
Day3      Wed
Day4    Thurs
Day5      Fri
dtype: object

In [11]:
courses = pd.Series(['Eco', 'Geo', 'Fin', 'Maths', 'Hist'], index='Day1 Day2 Day3 Day4 Day5'.split())
courses

Day1      Eco
Day2      Geo
Day3      Fin
Day4    Maths
Day5     Hist
dtype: object

In [12]:
courses = pd.Series(['Eco', 'Geo', 'Fin', 'Maths', 'Hist'], index='Day1, Day2, Day3, Day4, Day5'.split(', '))
courses

Day1      Eco
Day2      Geo
Day3      Fin
Day4    Maths
Day5     Hist
dtype: object

### Series concatenation based on index

In [13]:
days + ' ' + courses

Day1        Mon Eco
Day2       Tues Geo
Day3        Wed Fin
Day4    Thurs Maths
Day5       Fri Hist
dtype: object

### Accessing Series Data using index

In [14]:
courses['Day5']

'Hist'

In [15]:
days['Day3']

'Wed'

### loc & iloc

In [16]:
# Creating Series using dictionary
sports = {'Football':'Spain',
         'NBA':'USA',
         'Cricket':'India',
         'Atheltes':'Jamaica'}
sports_series = pd.Series(sports)
sports_series

Football      Spain
NBA             USA
Cricket       India
Atheltes    Jamaica
dtype: object

In [17]:
sports_series.loc['Cricket']

'India'

In [18]:
sports_series.iloc[2]

'India'

In [19]:
sports_series['Cricket']

'India'

In [20]:
s2 = pd.Series([100, 200, 300], index=[10, 20, 30])
s2

10    100
20    200
30    300
dtype: int64

In [21]:
s2[10]

np.int64(100)

In [22]:
s2.loc[10]

np.int64(100)

## DataFrame

In [23]:
random_normal_distribution_array = np.random.randn(10,5)
random_normal_distribution_array

array([[-1.15620478, -0.56341221, -0.79662428,  1.29498899, -0.92932348],
       [-1.40143072, -0.68038964,  3.1904329 , -0.25149287, -0.35201518],
       [-1.66019132, -0.46642121,  0.70606379, -1.02768461,  0.20012957],
       [-0.69429337,  1.33535679, -0.87953403,  1.19219857, -0.25455964],
       [-0.30250525,  2.16555376, -1.80483427, -0.51295214, -0.26671156],
       [-0.81149231, -0.91658501,  0.61267272,  4.04095019,  1.02252643],
       [ 0.34483881,  0.54458732,  1.00875977, -0.27998699, -0.05373268],
       [ 0.51524421,  1.03946762, -1.06751501,  0.81833621, -0.36184221],
       [ 1.7423124 ,  0.03031608, -1.00742147, -0.26809307, -1.5361399 ],
       [ 1.53992399,  0.2829207 ,  0.36117721,  0.5064855 , -1.18587451]])

In [24]:
np.min(random_normal_distribution_array)

np.float64(-1.8048342725551343)

In [25]:
np.max(random_normal_distribution_array)

np.float64(4.040950186117787)

In [26]:
my_dataframe = pd.DataFrame(np.random.randn(10,5), index='row1, row2, row3, row4, row5, row6, row7, row8, row9, row10'.split(', '),
                            columns='column1, column2, column3, column4, column5'.split(', '))
my_dataframe

        column1   column2   column3   column4   column5
row1  -1.536194 -1.680750  0.365537 -0.159917  1.260504
row2   0.023340 -0.120431 -1.224938  1.392126 -1.438621
row3   1.106062  1.585168 -1.148278 -0.256657 -0.327631
row4  -0.446464  0.112001 -0.019768  0.649311 -1.803717
row5   0.312866  0.193582 -0.987342 -0.049292  1.748433
row6   1.389944  0.587022  2.976205 -0.519560  0.209446
row7  -1.721437  0.289648 -0.021254 -0.585060  1.004581
row8   1.043636 -0.364777 -0.931390 -0.449359 -0.291692
row9   0.139602  0.681334  0.375297  0.523869 -0.443590
row10  0.453671 -0.115411 -1.683773 -0.640218 -0.500256

In [27]:
type(my_dataframe)

pandas.core.frame.DataFrame

In [28]:
type(my_dataframe['column1'])

pandas.core.series.Series

In [29]:
# Selecting particular column/series
my_dataframe['column1']

row1    -1.536194
row2     0.023340
row3     1.106062
row4    -0.446464
row5     0.312866
row6     1.389944
row7    -1.721437
row8     1.043636
row9     0.139602
row10    0.453671
Name: column1, dtype: float64

### Selection and Indexing

In [30]:
# Selecting multiple columns at time from DataFrame
my_dataframe[['column1', 'column3', 'column5']]

        column1   column3   column5
row1  -1.536194  0.365537  1.260504
row2   0.023340 -1.224938 -1.438621
row3   1.106062 -1.148278 -0.327631
row4  -0.446464 -0.019768 -1.803717
row5   0.312866 -0.987342  1.748433
row6   1.389944  2.976205  0.209446
row7  -1.721437 -0.021254  1.004581
row8   1.043636 -0.931390 -0.291692
row9   0.139602  0.375297 -0.443590
row10  0.453671 -1.683773 -0.500256

### Let's add new column to our DataFrame

In [31]:
my_dataframe['column6'] = my_dataframe['column1']*2
my_dataframe

        column1   column2   column3   column4   column5   column6
row1  -1.536194 -1.680750  0.365537 -0.159917  1.260504 -3.072389
row2   0.023340 -0.120431 -1.224938  1.392126 -1.438621  0.046680
row3   1.106062  1.585168 -1.148278 -0.256657 -0.327631  2.212123
row4  -0.446464  0.112001 -0.019768  0.649311 -1.803717 -0.892929
row5   0.312866  0.193582 -0.987342 -0.049292  1.748433  0.625732
row6   1.389944  0.587022  2.976205 -0.519560  0.209446  2.779888
row7  -1.721437  0.289648 -0.021254 -0.585060  1.004581 -3.442874
row8   1.043636 -0.364777 -0.931390 -0.449359 -0.291692  2.087272
row9   0.139602  0.681334  0.375297  0.523869 -0.443590  0.279205
row10  0.453671 -0.115411 -1.683773 -0.640218 -0.500256  0.907342

### Drop column from our DataFrame

In [32]:
my_dataframe.drop('column4', axis=1) # axis=1 refer to column

        column1   column2   column3   column5   column6
row1  -1.536194 -1.680750  0.365537  1.260504 -3.072389
row2   0.023340 -0.120431 -1.224938 -1.438621  0.046680
row3   1.106062  1.585168 -1.148278 -0.327631  2.212123
row4  -0.446464  0.112001 -0.019768 -1.803717 -0.892929
row5   0.312866  0.193582 -0.987342  1.748433  0.625732
row6   1.389944  0.587022  2.976205  0.209446  2.779888
row7  -1.721437  0.289648 -0.021254  1.004581 -3.442874
row8   1.043636 -0.364777 -0.931390 -0.291692  2.087272
row9   0.139602  0.681334  0.375297 -0.443590  0.279205
row10  0.453671 -0.115411 -1.683773 -0.500256  0.907342

In [33]:
my_dataframe # above dropping of column4 will not affect original dataframe

        column1   column2   column3   column4   column5   column6
row1  -1.536194 -1.680750  0.365537 -0.159917  1.260504 -3.072389
row2   0.023340 -0.120431 -1.224938  1.392126 -1.438621  0.046680
row3   1.106062  1.585168 -1.148278 -0.256657 -0.327631  2.212123
row4  -0.446464  0.112001 -0.019768  0.649311 -1.803717 -0.892929
row5   0.312866  0.193582 -0.987342 -0.049292  1.748433  0.625732
row6   1.389944  0.587022  2.976205 -0.519560  0.209446  2.779888
row7  -1.721437  0.289648 -0.021254 -0.585060  1.004581 -3.442874
row8   1.043636 -0.364777 -0.931390 -0.449359 -0.291692  2.087272
row9   0.139602  0.681334  0.375297  0.523869 -0.443590  0.279205
row10  0.453671 -0.115411 -1.683773 -0.640218 -0.500256  0.907342

In [34]:
my_dataframe.drop('column4', axis=1, inplace=True)
my_dataframe

        column1   column2   column3   column5   column6
row1  -1.536194 -1.680750  0.365537  1.260504 -3.072389
row2   0.023340 -0.120431 -1.224938 -1.438621  0.046680
row3   1.106062  1.585168 -1.148278 -0.327631  2.212123
row4  -0.446464  0.112001 -0.019768 -1.803717 -0.892929
row5   0.312866  0.193582 -0.987342  1.748433  0.625732
row6   1.389944  0.587022  2.976205  0.209446  2.779888
row7  -1.721437  0.289648 -0.021254  1.004581 -3.442874
row8   1.043636 -0.364777 -0.931390 -0.291692  2.087272
row9   0.139602  0.681334  0.375297 -0.443590  0.279205
row10  0.453671 -0.115411 -1.683773 -0.500256  0.907342

In [35]:
# Dropping row from DataFrame
my_dataframe.drop('row2', axis=0, inplace=True)
my_dataframe

        column1   column2   column3   column5   column6
row1  -1.536194 -1.680750  0.365537  1.260504 -3.072389
row3   1.106062  1.585168 -1.148278 -0.327631  2.212123
row4  -0.446464  0.112001 -0.019768 -1.803717 -0.892929
row5   0.312866  0.193582 -0.987342  1.748433  0.625732
row6   1.389944  0.587022  2.976205  0.209446  2.779888
row7  -1.721437  0.289648 -0.021254  1.004581 -3.442874
row8   1.043636 -0.364777 -0.931390 -0.291692  2.087272
row9   0.139602  0.681334  0.375297 -0.443590  0.279205
row10  0.453671 -0.115411 -1.683773 -0.500256  0.907342

In [36]:
# accessing data element using iloc e.g 2nd row with index location '1'
my_dataframe.iloc[1]

column1    1.106062
column2    1.585168
column3   -1.148278
column5   -0.327631
column6    2.212123
Name: row3, dtype: float64

In [37]:
type(my_dataframe.iloc[1])

pandas.core.series.Series

In [38]:
my_dataframe.loc['row3', 'column2']

np.float64(1.5851678816318506)

In [39]:
my_dataframe['column3']

row1     0.365537
row3    -1.148278
row4    -0.019768
row5    -0.987342
row6     2.976205
row7    -0.021254
row8    -0.931390
row9     0.375297
row10   -1.683773
Name: column3, dtype: float64

### Reset Index

In [40]:
my_dataframe.index

Index(['row1', 'row3', 'row4', 'row5', 'row6', 'row7', 'row8', 'row9',
       'row10'],
      dtype='object')

In [41]:
my_dataframe['spin'] = ['sp1', 'sp3', 'sp4', 'sp5', 'sp6', 'sp7', 'sp8', 'sp9', 'sp10']
my_dataframe

        column1   column2   column3   column5   column6  spin
row1  -1.536194 -1.680750  0.365537  1.260504 -3.072389   sp1
row3   1.106062  1.585168 -1.148278 -0.327631  2.212123   sp3
row4  -0.446464  0.112001 -0.019768 -1.803717 -0.892929   sp4
row5   0.312866  0.193582 -0.987342  1.748433  0.625732   sp5
row6   1.389944  0.587022  2.976205  0.209446  2.779888   sp6
row7  -1.721437  0.289648 -0.021254  1.004581 -3.442874   sp7
row8   1.043636 -0.364777 -0.931390 -0.291692  2.087272   sp8
row9   0.139602  0.681334  0.375297 -0.443590  0.279205   sp9
row10  0.453671 -0.115411 -1.683773 -0.500256  0.907342  sp10

In [42]:
my_dataframe.set_index('spin', inplace=True)
my_dataframe

       column1   column2   column3   column5   column6
spin
sp1  -1.536194 -1.680750  0.365537  1.260504 -3.072389
sp3   1.106062  1.585168 -1.148278 -0.327631  2.212123
sp4  -0.446464  0.112001 -0.019768 -1.803717 -0.892929
sp5   0.312866  0.193582 -0.987342  1.748433  0.625732
sp6   1.389944  0.587022  2.976205  0.209446  2.779888
sp7  -1.721437  0.289648 -0.021254  1.004581 -3.442874
sp8   1.043636 -0.364777 -0.931390 -0.291692  2.087272
sp9   0.139602  0.681334  0.375297 -0.443590  0.279205
sp10  0.453671 -0.115411 -1.683773 -0.500256  0.907342

### Rename column name

In [43]:
my_dataframe.rename(columns={'column1':'first', 'column2':'second', 'column3':'thrid', 'column5':'fourth', 
                             'column6':'fifth'}, inplace=True)
my_dataframe

         first    second     thrid    fourth     fifth
spin
sp1  -1.536194 -1.680750  0.365537  1.260504 -3.072389
sp3   1.106062  1.585168 -1.148278 -0.327631  2.212123
sp4  -0.446464  0.112001 -0.019768 -1.803717 -0.892929
sp5   0.312866  0.193582 -0.987342  1.748433  0.625732
sp6   1.389944  0.587022  2.976205  0.209446  2.779888
sp7  -1.721437  0.289648 -0.021254  1.004581 -3.442874
sp8   1.043636 -0.364777 -0.931390 -0.291692  2.087272
sp9   0.139602  0.681334  0.375297 -0.443590  0.279205
sp10  0.453671 -0.115411 -1.683773 -0.500256  0.907342

In [44]:
my_dataframe.rename(columns={'first':1})

             1    second     thrid    fourth     fifth
spin
sp1  -1.536194 -1.680750  0.365537  1.260504 -3.072389
sp3   1.106062  1.585168 -1.148278 -0.327631  2.212123
sp4  -0.446464  0.112001 -0.019768 -1.803717 -0.892929
sp5   0.312866  0.193582 -0.987342  1.748433  0.625732
sp6   1.389944  0.587022  2.976205  0.209446  2.779888
sp7  -1.721437  0.289648 -0.021254  1.004581 -3.442874
sp8   1.043636 -0.364777 -0.931390 -0.291692  2.087272
sp9   0.139602  0.681334  0.375297 -0.443590  0.279205
sp10  0.453671 -0.115411 -1.683773 -0.500256  0.907342

### Reading a Dataset with Pandas

In [45]:
raw_file_path = '/Users/vishalsaxena/Documents/DS_Workspace/ds_bootcamp/data/raw/Automobile.csv'
data = pd.read_csv(raw_file_path)
data.head(15)

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,3,168,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,168,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,168,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.40,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.40,8.0,115,5500,18,22,17450
5,2,161,audi,gas,std,two,sedan,fwd,front,99.8,...,136,mpfi,3.19,3.40,8.5,110,5500,19,25,15250
6,1,158,audi,gas,std,four,sedan,fwd,front,105.8,...,136,mpfi,3.19,3.40,8.5,110,5500,19,25,17710
7,1,168,audi,gas,std,four,wagon,fwd,front,105.8,...,136,mpfi,3.19,3.40,8.5,110,5500,19,25,18920
8,1,158,audi,gas,turbo,four,sedan,fwd,front,105.8,...,131,mpfi,3.13,3.40,8.3,140,5500,17,20,23875
9,2,192,bmw,gas,std,two,sedan,rwd,front,101.2,...,108,mpfi,3.50,2.80,8.8,101,5800,23,29,16430
10,0,192,bmw,gas,std,four,sedan,rwd,front,101.2,...,108,mpfi,3.50,2.80,8.8,101,5800,23,29,16925
11,0,188,bmw,gas,std,two,sedan,rwd,front,101.2,...,164,mpfi,3.31,3.19,9.0,121,4250,21,28,20970
12,0,188,bmw,gas,std,four,sedan,rwd,front,101.2,...,164,mpfi,3.31,3.19,9.0,121,4250,21,28,21105
13,1,149,bmw,gas,std,four,sedan,rwd,front,103.5,...,164,mpfi,3.31,3.19,9.0,121,4250,20,25,24565
14,0,149,bmw,gas,std,four,sedan,rwd,front,103.5,...,209,mpfi,3.62,3.39,8.0,182,5400,16,22,30760

In [46]:
data.tail()

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
196,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,16845
197,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,8.7,160,5300,19,25,19045
198,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,173,mpfi,3.58,2.87,8.8,134,5500,18,23,21485
199,-1,95,volvo,diesel,turbo,four,sedan,rwd,front,109.1,...,145,idi,3.01,3.40,23.0,106,4800,26,27,22470
200,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625

In [47]:
data['make']

0      alfa-romero
1      alfa-romero
2      alfa-romero
3             audi
4             audi
          ...
196          volvo
197          volvo
198          volvo
199          volvo
200          volvo
Name: make, Length: 201, dtype: object

### Printing column label

In [62]:
data.columns

Index(['symboling', 'normalized_losses', 'make', 'fuel_type', 'aspiration',
       'number_of_doors', 'body_style', 'drive_wheels', 'engine_location',
       'wheel_base', 'length', 'width', 'height', 'curb_weight', 'engine_type',
       'number_of_cylinders', 'engine_size', 'fuel_system', 'bore', 'stroke',
       'compression_ratio', 'horsepower', 'peak_rpm', 'city_mpg',
       'highway_mpg', 'price'],
      dtype='object')

### Printing index labels

In [51]:
data.index

RangeIndex(start=0, stop=201, step=1)

### Checking null values in DataFrame

In [52]:
data.isnull()

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
197,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
198,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
199,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
200,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [53]:
data.isnull().sum()

symboling              0
normalized_losses      0
make                   0
fuel_type              0
aspiration             0
number_of_doors        0
body_style             0
drive_wheels           0
engine_location        0
wheel_base             0
length                 0
width                  0
height                 0
curb_weight            0
engine_type            0
number_of_cylinders    0
engine_size            0
fuel_system            0
bore                   0
stroke                 0
compression_ratio      0
horsepower             0
peak_rpm               0
city_mpg               0
highway_mpg            0
price                  0
dtype: int64

In [54]:
data.isna()

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
197,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
198,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
199,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
200,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [55]:
data.isna().sum()

symboling              0
normalized_losses      0
make                   0
fuel_type              0
aspiration             0
number_of_doors        0
body_style             0
drive_wheels           0
engine_location        0
wheel_base             0
length                 0
width                  0
height                 0
curb_weight            0
engine_type            0
number_of_cylinders    0
engine_size            0
fuel_system            0
bore                   0
stroke                 0
compression_ratio      0
horsepower             0
peak_rpm               0
city_mpg               0
highway_mpg            0
price                  0
dtype: int64

### Using describe to get 5 nunber summary

In [57]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
symboling,201.0,0.840796,1.254802,-2.00,0.00,1.00,2.00,3.00
normalized_losses,201.0,125.189055,33.572966,65.00,101.00,122.00,150.00,256.00
wheel_base,201.0,98.797015,6.066366,86.60,94.50,97.00,102.40,120.90
length,201.0,174.200995,12.322175,141.10,166.80,173.20,183.50,208.10
width,201.0,65.889055,2.101471,60.30,64.10,65.50,66.60,72.00
height,201.0,53.766667,2.447822,47.80,52.00,54.10,55.50,59.80
curb_weight,201.0,2555.666667,517.296727,1488.00,2169.00,2414.00,2926.00,4066.00
engine_size,201.0,126.875622,41.546834,61.00,98.00,120.00,141.00,326.00
bore,201.0,3.329701,0.268166,2.54,3.15,3.31,3.58,3.94
stroke,201.0,3.261741,0.317875,2.07,3.11,3.29,3.46,4.17
compression_ratio,201.0,10.164279,4.004965,7.00,8.60,9.00,9.40,23.00
horsepower,201.0,103.263682,37.389372,48.00,70.00,95.00,116.00,262.00
peak_rpm,201.0,5121.393035,479.624905,4150.00,4800.00,5200.00,5500.00,6600.00
city_mpg,201.0,25.179104,6.423220,13.00,19.00,24.00,30.00,49.00
highway_mpg,201.0,30.686567,6.815150,16.00,25.00,30.00,34.00,54.00
price,201.0,13207.129353,7947.066342,5118.00,7775.00,10295.00,16500.00,45400.00

### Conditional Selection

In [64]:
data['price'].max()

45400

In [65]:
data['price'] > 40000

0      False
1      False
2      False
3      False
4      False
       ...
196    False
197    False
198    False
199    False
200    False
Name: price, Length: 201, dtype: bool

In [66]:
data[data['price']>40000]

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
15,0,149,bmw,gas,std,two,sedan,rwd,front,103.5,...,209,mpfi,3.62,3.39,8.0,182,5400,16,22,41315
70,0,140,mercedes-benz,gas,std,four,sedan,rwd,front,120.9,...,308,mpfi,3.80,3.35,8.0,184,4500,14,16,40960
71,1,140,mercedes-benz,gas,std,two,hardtop,rwd,front,112.0,...,304,mpfi,3.80,3.35,8.0,184,4500,14,16,45400

In [70]:
data[data['price']>20000]

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
8,1,158,audi,gas,turbo,four,sedan,fwd,front,105.8,...,131,mpfi,3.13,3.40,8.3,140,5500,17,20,23875
11,0,188,bmw,gas,std,two,sedan,rwd,front,101.2,...,164,mpfi,3.31,3.19,9.0,121,4250,21,28,20970
12,0,188,bmw,gas,std,four,sedan,rwd,front,101.2,...,164,mpfi,3.31,3.19,9.0,121,4250,21,28,21105
13,1,149,bmw,gas,std,four,sedan,rwd,front,103.5,...,164,mpfi,3.31,3.19,9.0,121,4250,20,25,24565
14,0,149,bmw,gas,std,four,sedan,rwd,front,103.5,...,209,mpfi,3.62,3.39,8.0,182,5400,16,22,30760
15,0,149,bmw,gas,std,two,sedan,rwd,front,103.5,...,209,mpfi,3.62,3.39,8.0,182,5400,16,22,41315
16,0,149,bmw,gas,std,four,sedan,rwd,front,110.0,...,209,mpfi,3.62,3.39,8.0,182,5400,15,20,36880
44,0,145,jaguar,gas,std,four,sedan,rwd,front,113.0,...,258,mpfi,3.63,4.17,8.1,176,4750,15,19,32250
45,0,115,jaguar,gas,std,four,sedan,rwd,front,113.0,...,258,mpfi,3.63,4.17,8.1,176,4750,15,19,35550
46,0,115,jaguar,gas,std,two,sedan,rwd,front,102.0,...,326,mpfi,3.54,2.76,11.5,262,5000,13,17,36000
64,-1,93,mercedes-benz,diesel,turbo,four,sedan,rwd,front,110.0,...,183,idi,3.58,3.64,21.5,123,4350,22,25,25552
65,-1,93,mercedes-benz,diesel,turbo,four,wagon,rwd,front,110.0,...,183,idi,3.58,3.64,21.5,123,4350,22,25,28248
66,0,93,mercedes-benz,diesel,turbo,two,hardtop,rwd,front,106.7,...,183,idi,3.58,3.64,21.5,123,4350,22,25,28176
67,-1,93,mercedes-benz,diesel,turbo,four,sedan,rwd,front,115.6,...,183,idi,3.58,3.64,21.5,123,4350,22,25,31600
68,-1,122,mercedes-benz,gas,std,four,sedan,rwd,front,115.6,...,234,mpfi,3.46,3.10,8.3,155,4750,16,18,34184
69,3,142,mercedes-benz,gas,std,two,convertible,rwd,front,96.6,...,234,mpfi,3.46,3.10,8.3,155,4750,16,18,35056
70,0,140,mercedes-benz,gas,std,four,sedan,rwd,front,120.9,...,308,mpfi,3.80,3.35,8.0,184,4500,14,16,40960
71,1,140,mercedes-benz,gas,std,two,hardtop,rwd,front,112.0,...,304,mpfi,3.80,3.35,8.0,184,4500,14,16,45400
122,3,186,porsche,gas,std,two,hatchback,rwd,front,94.5,...,151,mpfi,3.94,3.11,9.5,143,5500,19,27,22018
123,3,128,porsche,gas,std,two,hardtop,rwd,rear,89.5,...,194,mpfi,3.74,2.90,9.5,207,5900,17,25,32528
124,3,128,porsche,gas,std,two,hardtop,rwd,rear,89.5,...,194,mpfi,3.74,2.90,9.5,207,5900,17,25,34028
125,3,128,porsche,gas,std,two,convertible,rwd,rear,89.5,...,194,mpfi,3.74,2.90,9.5,207,5900,17,25,37028
198,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,173,mpfi,3.58,2.87,8.8,134,5500,18,23,21485
199,-1,95,volvo,diesel,turbo,four,sedan,rwd,front,109.1,...,145,idi,3.01,3.40,23.0,106,4800,26,27,22470
200,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625

### Which car price greater than 20000

In [75]:
data[data['price'] > 20000][['make', 'price']]

              make  price
8             audi  23875
11             bmw  20970
12             bmw  21105
13             bmw  24565
14             bmw  30760
15             bmw  41315
16             bmw  36880
44          jaguar  32250
45          jaguar  35550
46          jaguar  36000
64   mercedes-benz  25552
65   mercedes-benz  28248
66   mercedes-benz  28176
67   mercedes-benz  31600
68   mercedes-benz  34184
69   mercedes-benz  35056
70   mercedes-benz  40960
71   mercedes-benz  45400
122        porsche  22018
123        porsche  32528
124        porsche  34028
125        porsche  37028
198          volvo  21485
199          volvo  22470
200          volvo  22625

### Volvo cars that are priced less than 50000

In [81]:
(data['make'] == 'volvo') & (data['price'] < 50000)

0      False
1      False
2      False
3      False
4      False
       ...
196    False
197    False
198    False
199    False
200    False
Length: 201, dtype: bool

In [83]:
data[(data['make'] == 'volvo') & (data['price'] < 50000) ]

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
190,-2,103,volvo,gas,std,four,sedan,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,12940
191,-1,74,volvo,gas,std,four,wagon,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,13415
192,-2,103,volvo,gas,std,four,sedan,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.5,114,5400,24,28,15985
193,-1,74,volvo,gas,std,four,wagon,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.5,114,5400,24,28,16515
194,-2,103,volvo,gas,turbo,four,sedan,rwd,front,104.3,...,130,mpfi,3.62,3.15,7.5,162,5100,17,22,18420
195,-1,74,volvo,gas,turbo,four,wagon,rwd,front,104.3,...,130,mpfi,3.62,3.15,7.5,162,5100,17,22,18950
196,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,16845
197,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,8.7,160,5300,19,25,19045
198,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,173,mpfi,3.58,2.87,8.8,134,5500,18,23,21485
199,-1,95,volvo,diesel,turbo,four,sedan,rwd,front,109.1,...,145,idi,3.01,3.40,23.0,106,4800,26,27,22470
200,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625

### Selecting only make, price

In [84]:
data[(data['make'] == 'volvo') & (data['price'] < 50000)][['make', 'price']]

      make  price
190  volvo  12940
191  volvo  13415
192  volvo  15985
193  volvo  16515
194  volvo  18420
195  volvo  18950
196  volvo  16845
197  volvo  19045
198  volvo  21485
199  volvo  22470
200  volvo  22625

### Sorting values in DataFrame

In [113]:
data.sort_values(by=['price','normalized_losses'], ascending=False)
# data.sort_values(by=['price'], ascending=)

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
71,1,140,mercedes-benz,gas,std,two,hardtop,rwd,front,112.0,...,304,mpfi,3.80,3.35,8.0,184,4500,14,16,45400
15,0,149,bmw,gas,std,two,sedan,rwd,front,103.5,...,209,mpfi,3.62,3.39,8.0,182,5400,16,22,41315
70,0,140,mercedes-benz,gas,std,four,sedan,rwd,front,120.9,...,308,mpfi,3.80,3.35,8.0,184,4500,14,16,40960
125,3,128,porsche,gas,std,two,convertible,rwd,rear,89.5,...,194,mpfi,3.74,2.90,9.5,207,5900,17,25,37028
16,0,149,bmw,gas,std,four,sedan,rwd,front,110.0,...,209,mpfi,3.62,3.39,8.0,182,5400,15,20,36880
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
73,2,161,mitsubishi,gas,std,two,hatchback,fwd,front,93.7,...,92,2bbl,2.97,3.23,9.4,68,5500,37,41,5389
146,1,87,toyota,gas,std,two,hatchback,fwd,front,95.7,...,92,2bbl,3.05,3.03,9.0,62,4800,35,39,5348
47,1,104,mazda,gas,std,two,hatchback,fwd,front,93.1,...,91,2bbl,3.03,3.15,9.0,68,5000,30,31,5195
17,2,121,chevrolet,gas,std,two,hatchback,fwd,front,88.4,...,61,2bbl,2.91,3.03,9.5,48,5100,47,53,5151
134,2,83,subaru,gas,std,two,hatchback,fwd,front,93.7,...,97,2bbl,3.62,2.36,9.0,69,4900,31,36,5118

### Group by

In [114]:
data.groupby('fuel_type').count()

,symboling,normalized_losses,make,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,length,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
fuel_type,,,,,,,,,,,,,,,,,,,,,
diesel,20,20,20,20,20,20,20,20,20,20,...,20,20,20,20,20,20,20,20,20,20
gas,181,181,181,181,181,181,181,181,181,181,...,181,181,181,181,181,181,181,181,181,181

In [124]:
data.groupby('fuel_type').describe().T

fuel_type              diesel           gas
symboling count     20.000000    181.000000
          mean       0.100000      0.922652
          std        0.967906      1.258123
          min       -1.000000     -2.000000
          25%       -0.250000      0.000000
...                       ...           ...
price     min     7099.000000   5118.000000
          25%     9120.000000   7609.000000
          50%    13852.500000   9989.000000
          75%    19375.500000  15985.000000
          max    31600.000000  45400.000000

[128 rows x 2 columns]

### count() & value_count()

In [115]:
data['make'].count()

np.int64(201)

In [116]:
data.count()

symboling              201
normalized_losses      201
make                   201
fuel_type              201
aspiration             201
number_of_doors        201
body_style             201
drive_wheels           201
engine_location        201
wheel_base             201
length                 201
width                  201
height                 201
curb_weight            201
engine_type            201
number_of_cylinders    201
engine_size            201
fuel_system            201
bore                   201
stroke                 201
compression_ratio      201
horsepower             201
peak_rpm               201
city_mpg               201
highway_mpg            201
price                  201
dtype: int64

In [118]:
data[(data['make'] == 'volvo') & (data['price'] < 50000)][['make', 'price']].count()

make     11
price    11
dtype: int64

### counting each item in the make column

In [120]:
data['make'].value_counts() # basically select count(make), make group by make

make
toyota           32
nissan           18
mazda            17
mitsubishi       13
honda            13
volkswagen       12
subaru           12
peugot           11
volvo            11
dodge             9
mercedes-benz     8
bmw               8
plymouth          7
audi              6
saab              6
porsche           4
jaguar            3
chevrolet         3
alfa-romero       3
isuzu             2
renault           2
mercury           1
Name: count, dtype: int64

### Dealing with null values

In [85]:
df = pd.DataFrame({'value1':[100, np.nan, 234, np.nan],
                   'value2':[300, 121, np.nan, np.nan],
                   'value3':['XUI', 'VYU', 'NMA', 'IUY']})
df.head()

   value1  value2 value3
0   100.0   300.0    XUI
1     NaN   121.0    VYU
2   234.0     NaN    NMA
3     NaN     NaN    IUY

In [86]:
df.isnull()

   value1  value2  value3
0   False   False   False
1    True   False   False
2   False    True   False
3    True    True   False

In [87]:
df.isnull().sum() # counting the total number of NaN in the dataset

value1    2
value2    2
value3    0
dtype: int64

In [88]:
df.isna()

   value1  value2  value3
0   False   False   False
1    True   False   False
2   False    True   False
3    True    True   False

In [89]:
df.isna().sum() # counting the total number of NaN in the dataset

value1    2
value2    2
value3    0
dtype: int64

In [103]:
df.fillna(df.select_dtypes(include='number').mean(), inplace=True)
df

   value1  value2 value3
0   100.0   300.0    XUI
1   167.0   121.0    VYU
2   234.0   210.5    NMA
3   167.0   210.5    IUY

In [94]:
df.describe()

           value1      value2
count    2.000000    2.000000
mean   167.000000  210.500000
std     94.752309  126.572114
min    100.000000  121.000000
25%    133.500000  165.750000
50%    167.000000  210.500000
75%    200.500000  255.250000
max    234.000000  300.000000

In [104]:
df.sort_values(by='value2', ascending=True)

   value1  value2 value3
1   167.0   121.0    VYU
2   234.0   210.5    NMA
3   167.0   210.5    IUY
0   100.0   300.0    XUI

### Concatenation

In [125]:
mm = {
    'one':[2,3,1,4,5],
    'two':[5,4,3,2,1],
    'letter':['a','a','b','b','c']
}
mm

{'one': [2, 3, 1, 4, 5],
 'two': [5, 4, 3, 2, 1],
 'letter': ['a', 'a', 'b', 'b', 'c']}

In [126]:
mm_df = pd.DataFrame(mm)
mm_df

   one  two letter
0    2    5      a
1    3    4      a
2    1    3      b
3    4    2      b
4    5    1      c

In [127]:
mm_df_concat = pd.concat([df, mm_df])
mm_df_concat # This will keep df top of the mm_df

   value1  value2 value3  one  two letter
0   100.0   300.0    XUI  NaN  NaN    NaN
1   167.0   121.0    VYU  NaN  NaN    NaN
2   234.0   210.5    NMA  NaN  NaN    NaN
3   167.0   210.5    IUY  NaN  NaN    NaN
0     NaN     NaN    NaN  2.0  5.0      a
1     NaN     NaN    NaN  3.0  4.0      a
2     NaN     NaN    NaN  1.0  3.0      b
3     NaN     NaN    NaN  4.0  2.0      b
4     NaN     NaN    NaN  5.0  1.0      c

In [128]:
mm_df_concat = pd.concat([df, mm_df], axis=1)
mm_df_concat # put dataframe side by side

   value1  value2 value3  one  two letter
0   100.0   300.0    XUI    2    5      a
1   167.0   121.0    VYU    3    4      a
2   234.0   210.5    NMA    1    3      b
3   167.0   210.5    IUY    4    2      b
4     NaN     NaN    NaN    5    1      c

### Join DataFrame (left, right, inner, outer)

In [129]:
sales = {
    'Jones':10000,
    'Chris':5000,
    'Piyush':440,
    'Meera':6700,
    'Rahul':300
}

region = {
    'Jones':'West',
    'Chris': np.nan,
    'Piyush':'West',
    'Meera':np.nan,
    'Anthony':'East',
    'Ellen':'South',
    'Josh':'West',
    'Simran':'East',
    'Oscar':'North'
}

In [138]:
sales_df = pd.DataFrame.from_dict(sales, orient='index', columns=['sales'])
sales_df.index.name = 'names'
sales_df

        sales
names
Jones   10000
Chris    5000
Piyush    440
Meera    6700
Rahul     300

In [140]:
region_df = pd.DataFrame.from_dict(region, orient='index', columns=['region'])
region_df.index.name = 'names'
region_df

        region
names
Jones     West
Chris      NaN
Piyush    West
Meera      NaN
Anthony   East
Ellen    South
Josh      West
Simran    East
Oscar    North

In [141]:
joined_df = region_df.join(sales_df, how='left')
joined_df

        region    sales
names
Jones     West  10000.0
Chris      NaN   5000.0
Piyush    West    440.0
Meera      NaN   6700.0
Anthony   East      NaN
Ellen    South      NaN
Josh      West      NaN
Simran    East      NaN
Oscar    North      NaN

In [142]:
joined_df = region_df.join(sales_df, how='right')
joined_df

       region  sales
names
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700
Rahul     NaN    300

In [143]:
joined_df = region_df.join(sales_df, how='inner')
joined_df

       region  sales
names
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700

In [145]:
joined_df = region_df.join(sales_df, how='outer')
joined_df

        region    sales
names
Anthony   East      NaN
Chris      NaN   5000.0
Ellen    South      NaN
Jones     West  10000.0
Josh      West      NaN
Meera      NaN   6700.0
Oscar    North      NaN
Piyush    West    440.0
Rahul      NaN    300.0
Simran    East      NaN

### Merge DataFrame

In [153]:
region_df.index.name = 'names'
region_df

        region
names
Jones     West
Chris      NaN
Piyush    West
Meera      NaN
Anthony   East
Ellen    South
Josh      West
Simran    East
Oscar    North

In [156]:
print(region_df.join(sales_df, how='inner'))
pd.merge(region_df, sales_df, on='names', how='inner')

       region  sales
names
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700

       region  sales
names
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700

In [157]:
pd.merge(region_df, sales_df, on='names', how='outer')

        region    sales
names
Anthony   East      NaN
Chris      NaN   5000.0
Ellen    South      NaN
Jones     West  10000.0
Josh      West      NaN
Meera      NaN   6700.0
Oscar    North      NaN
Piyush    West    440.0
Rahul      NaN    300.0
Simran    East      NaN

In [158]:
pd.merge(region_df, sales_df, on='names', how='left')

        region    sales
names
Jones     West  10000.0
Chris      NaN   5000.0
Piyush    West    440.0
Meera      NaN   6700.0
Anthony   East      NaN
Ellen    South      NaN
Josh      West      NaN
Simran    East      NaN
Oscar    North      NaN

In [159]:
pd.merge(region_df, sales_df, on='names', how='right')

       region  sales
names
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700
Rahul     NaN    300